{
  "url": "https://www.churchofjesuschrist.org/study/manual/hymns/using-the-hymnbook?lang=eng&id=title15-figure3_p1#title15",
  "title": "Using the Hymnbook",
  "description": "Using the Hymnbook",
  "timestamp": "2026-01-10T12:09:31.481963",
  "content": "The following material is intended to help you use the hymnbook effectively. Included are explanations of the elements of the hymnbook; discussions on using the hymns for congregations, choirs, and special groups; and information for beginning music directors, organists, and pianists.\nThe table of contents groups the hymns into eleven general categories. Hymns of similar subject and mood are generally found in the same section. However, being listed in a certain category should not limit the use of any hymn. For example, some hymns in the sacrament section, such as\n“How Great the Wisdom and the Love”\nand\n“I Stand All Amazed,”\nmay be used for other purposes, and selected verses of several of the hymns in this section may be used for Easter. The index of topics will help you find hymns on specific subjects.\nThe mood markings, such as\nPrayerfully\nor\nResolutely,\nsuggest the general feeling or spirit of a hymn, although the mood of some hymns may vary according to the occasion or local preferences. Metronomic markings indicate a tempo range (such as\n= 69–76) and are also given as general guidelines; the locale and context in which a hymn is used may suggest greater flexibility.\nBrackets (\n) on each hymn suggest a suitable piano or organ introduction. Before playing a hymn, scan it to make sure you see the complete introduction. You may want to highlight the brackets in your personal hymnbook, especially if the final phrase of an introduction does not happen to be at the end of the hymn.\nYou may also wish to shorten or lengthen the suggested introduction. If the hymn is unfamiliar, playing it completely through as an introduction can help the congregation feel more comfortable with it. If the hymn is well known, the last line or phrase may be a sufficient introduction. When using a short introduction, you may want to slow the tempo at the end to express a sense of completion.\nIn early Christian tradition, most hymns were musical settings of adapted scriptural texts. Most of our current hymns relate to a number of scriptures; some of the many possibilities are listed at the end of each hymn. Using the Topical Guide and Index found in the Latter-day Saint edition of the scriptures, you will find many more verses of scripture that enrich the messages of our hymns.\nThe hymnbook contains seven indexes with brief explanatory notes for each one:\nAuthors and Composers\n;\nTitles, Tunes, and Meters\n;\nTune Names\n;\nMeters\n;\nScriptures\n;\nTopics\n; and\nFirst Lines and Titles.\nAlthough part singing (soprano, alto, tenor, and bass) has a strong tradition in the Church, the goal in congregational singing is that all participate, no matter what their vocal ability may be. Because many members sing the melody, regardless of their vocal range, the hymns are in keys that accommodate both unison and part singing. Some hymns—and parts of hymns—are specifically written for unison singing.\nThe hymns you select should reflect the general character of the meeting and help establish the proper spirit.\nThe\nopening hymn\nmay be one of supplication or praise; it may express gratitude for the gospel, joy in being able to gather together, or enthusiasm for the work to be done.\nThe\nsacrament hymn\nshould refer to the sacrament itself or to the sacrifice of the Savior.\nAn\nintermediate hymn\nprovides an opportunity for congregational participation and may relate to the subject of the talks presented in the meeting. The congregation may stand during this hymn as appropriate.\nThe\nclosing hymn\nis an opportunity for the congregation to respond to the spirit and content of the meeting.\nNot every hymn is suitable for every Church-related occasion. Some hymns may be more appropriate for a youth gathering than for a sacrament meeting.\nYou need not feel compelled to sing all the verses of a hymn unless the message is otherwise incomplete. However, do not routinely shorten a hymn by singing just the first one or two verses. Singing the verses printed below the music is encouraged.\nIn addition to using hymns already known and loved, members are encouraged to become acquainted with new or less familiar hymns. Try to achieve a good balance between familiar favorites and less well-known hymns.\nStandard, well-known hymns are often the best choice for stake conference, particularly if hymnbooks are not available for the entire congregation. Here are a few such hymns:\n“Come, Come, Ye Saints”\n;\n“Come, O Thou King of Kings”\n;\n“Come, Ye Children of the Lord”\n;\n“Count Your Blessings”\n;\n“Do What Is Right”\n;\n“Guide Us, O Thou Great Jehovah”\n;\n“High on the Mountain Top”\n;\n“How Firm a Foundation”\n;\n“I Am a Child of God”\n;\n“I Know That My Redeemer Lives”\n;\n“Let Us All Press On”\n;\n“Now Let Us Rejoice”\n;\n“Praise to the Man”\n;\n“Put Your Shoulder to the Wheel”\n;\n“Redeemer of Israel”\n;\n“Sweet Is the Work”\n;\n“The Spirit of God”\n;\n“We Thank Thee, O God, for a Prophet.”\nYou may copy the hymns on a printed program unless the copyright restrictions on the hymn state that this is not permitted.\nA few patriotic songs have been included in the hymnbook; with priesthood approval, local national anthems may be added. Members may stand for national anthems in church meetings, according to local custom and priesthood direction.\nIn this edition of the hymnbook no distinction is made between choir and congregational hymns. Choirs should use the hymnbook as their basic resource, selecting from the entire book. Choirs may also sing other appropriate anthems and hymn arrangements not included in the hymnbook.\nSome of the hymns labeled “Choir” in previous hymnbook editions have been transposed to lower keys for greater congregational use. Choirs may want to keep copies of the past editions of the hymnbook to take advantage of higher keys and the possibility of modulating from one key to another. If only one copy of a previous edition is available, a hymn may be copied and used for this purpose, unless this is prohibited by the copyright notice.\nHymns from the hymnbook, sung without variation, are always appropriate as choir selections. You may also vary your presentation of the hymns; however, use such variations sparingly, making sure they are consistent with the spirit of the hymn. Here are a few hymn adaptations you may wish to consider:\nHave the men, the women, or both sing one verse in unison.\nHave the congregation join the choir on the final verse or chorus of a hymn. (This is one way to help the congregation become more familiar with some of the hymns.)\nHave the women sing one verse, as outlined below under “Hymns for Women’s Voices.”\nHave the men sing one verse, as outlined below under “Hymns for Men’s Voices.”\nHave the soprano and tenor sections sing a duet for one verse.\nHave the tenors and basses sing the melody while the sopranos and altos sing the alto part.\nHave one section of the choir sing the melody while the rest of the choir hums the other parts.\nIn the women’s section of the book are hymns for women’s congregations and hymns that have been prepared for women’s choirs and trios. In addition, the sisters can sing without adaptation most of the other hymns in the book in two parts (soprano and alto) or in three parts (if the tenor part is not too low).\nThe hymns in the men’s section of the book are divided into two categories:\nMen,\nfor men’s congregations, and\nMen’s Choir,\nfor choirs and quartets. For a congregational hymn in priesthood meeting, it is generally preferable to choose from the standard congregational hymns or from those marked\nMen.\nSeveral hymns are specifically arranged for men’s choirs; in addition, many hymns for congregations and those marked\nMen\ncan be adapted for use by men’s choirs and quartets:\nBaritones:\nSing melody\n1st Tenors:\nSing alto above the melody\n2nd Tenors:\nSing Tenor\nBasses:\nSing Bass\nThe main problem in adapting hymns for a men’s choir is finding tenors who can sing as high as the alto may go; some high notes may need to be adapted. You may also transpose the hymn to a lower key, adapting the bass part.\nFor an example of an adaptation in the hymnbook, compare\n“Should You Feel Inclined to Censure”\n(no. 235), a congregational arrangement, with\n“Brightly Beams Our Father’s Mercy”\n(no. 335), the same music arranged for men’s voices.\nAnother possibility in adapting a hymn for a men’s choir is to have the alto part sung below the melody. When this is done, the bass part is optional.\nYou will note that in the hymns arranged for men’s choirs, a tenor clef symbol is used instead of the usual treble clef symbol. You should generally play the right-hand notes of these hymns an octave lower than the treble clef. The result is a rich, effective accompaniment for men’s voices.\nTenor clef symbol\nTreble clef symbol\nA measure is the smallest musical unit bordered by vertical lines:\nIn the hymnbook, when a measure is carried over from one line of music to the next, the end of the first line is left open to show that the measure continues on to the next line:\nThe time signature (two numbers, one above the other, such as\n) is found at the beginning of each hymn. The top number indicates the number of beats or pulses in each measure. The bottom number tells what kind of note gets a beat or pulse. For example, a\ntime signature means there are three beats per measure in the hymn, and a quarter note (\n) gets one beat.\nAs you direct the music, the first beat of your beat pattern (see beat pattern illustrations) should correspond with the first beat in each measure. This first beat, called the downbeat, is the strongest beat in each measure. You will note that many hymns begin on an upbeat, or pickup note, before the first downbeat.\nThe purpose of beat patterns is to keep the congregation together rhythmically and to communicate the mood and spirit of the hymn. Patterns should be kept simple, but may vary according to the nature and mood of the hymn. The dots on the beat patterns show where the rhythmic pulses of the hymn occur.\nThe\ntwo-beat pattern\n(used for hymns marked\nor\n):\nThe\nthree-beat pattern\n(used for hymns marked\nor\n):\nThe\nfour-beat pattern\n(used for hymns marked\n):\nThe\nsix-beat pattern\n(used for hymns marked\nor\n):\nA\nor\nhymn with a slow tempo, such as\n“Silent Night”\n(no. 204), may be conducted with either the traditional six-beat pattern or a double three-beat pattern—first a large one, followed by a smaller one:\nA\nor\nhymn with a moderate tempo, such as\n“Dear to the Heart of the Shepherd”\n(no. 221), may be conducted by omitting the second and fifth beats of the traditional six-beat pattern, and pausing at those points in the pattern:\nA\nor\nhymn with a fast tempo, such as\n“Master, the Tempest Is Raging”\n(no. 105), may be conducted with a two-beat pattern—the first three beats go with the first stroke, and the last three beats go with the second stroke:\nWhen using the last two beat patterns, be sure to keep the rhythm or pulses of the hymn constant.\nThe two-beat pattern:\n“Come, Rejoice”\n;\n“Come, Thou Glorious Day of Promise”\n;\n“God Speed the Right”\n; and\n“Ye Who Are Called to Labor.”\nThe three-beat pattern:\n“Come, Follow Me”\n;\n“Do What Is Right”\n;\n“Glory to God on High”\n;\n“God, Our Father, Hear Us Pray”\n;\n“Teach Me to Walk in the Light.”\nThe four-beat pattern:\n“Abide with Me!”\n;\n“As I Search the Holy Scriptures”\n;\n“Come, Ye Children of the Lord”\n;\n“Did You Think to Pray?”\n;\n“For the Beauty of the Earth”\n;\n“Hark, All Ye Nations”\n;\n“Hope of Israel”\n;\n“We Will Sing of Zion.”\nSome hymns may have notes or passages that are difficult to play. Feel free to adapt such passages to your own ability by dropping less important notes from chords. You may want to mark your own hymnbook for this purpose.\nHymns frequently have a space between the tenor and bass notes that is too wide to reach with the left hand. Often the right hand can include the tenor note quite easily. You may want to mark such notes with a bracket to remind yourself to play them with your right hand:\nSome hymns and children’s songs are written with the piano in mind. If the organ is used for these songs, it is sometimes preferable to use manuals only, without pedals.\nA cue note, or small note, means that the note is optional. Following are examples of how cue notes may be used:\nA cue note may indicate that the notes are to be played and sung with some verses and not with others, depending on the text of each verse:\nSometimes the music is complete even if the cue note is left out:\nCue notes may also indicate music to be played by the pianist or organist but not to be sung:\n“Come, Follow Me”\n;\n“Do What Is Right”\n;\n“God Be with You”\n;\n“How Gentle God’s Commands”\n;\n“I Stand All Amazed”\n;\n“Keep the Commandments”\n;\n“Let the Holy Spirit Guide”\n;\n“Now Let Us Rejoice”\n;\n“Redeemer of Israel\n”;\n“Sweet Is the Work”\n;\n“Sweet Hour of Prayer”\n;\n“Teach Me to Walk in the Light”\n;\n“We Thank Thee, O God, for a Prophet.”",
  "depth": 2
}