{
  "url": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/24?lang=eng",
  "title": "Doctrine and Covenants 24",
  "description": "Revelation given to Joseph Smith the Prophet and Oliver Cowdery, at Harmony, Pennsylvania, July 1830. Though less than four months had elapsed since the Church was organized, persecution had become intense, and the leaders had to seek safety in partial seclusion. The following three revelations were given at this time to strengthen, encourage, and instruct them.",
  "timestamp": "2026-01-10T12:10:36.922914",
  "content": "1\nBehold, thou wast called and chosen to\nwrite\nthe Book of Mormon, and to my ministry; and I have\nlifted\nthee up out of thine afflictions, and have counseled thee, that thou hast been delivered from all thine enemies, and thou hast been\ndelivered\nfrom the powers of Satan and from\ndarkness\n!\n2\nNevertheless, thou art not excusable in thy\ntransgressions\n; nevertheless, go thy way and sin no more.\n3\nMagnify\nthine office; and after thou hast\nsowed\nthy fields and secured them, go speedily unto the church which is in\nColesville\n, Fayette, and Manchester, and they shall\nsupport\nthee; and I will bless them both spiritually and\ntemporally\n;\n4\nBut if they receive thee not, I will send upon them a\ncursing\ninstead of a blessing.\n5\nAnd thou shalt continue in calling upon God in my name, and writing the things which shall be given thee by the\nComforter\n, and expounding all scriptures unto the church.\n6\nAnd it shall be given thee in the very moment what thou shalt\nspeak\nand\nwrite\n, and they shall hear it, or I will send unto them a cursing instead of a blessing.\n7\nFor thou shalt devote all thy\nservice\nin Zion; and in this thou shalt have strength.\n8\nBe\npatient\nin\nafflictions\n, for thou shalt have many; but\nendure\nthem, for, lo, I am with thee, even unto the\nend\nof thy days.\n9\nAnd in temporal labors thou shalt not have strength, for this is not thy calling. Attend to thy\ncalling\nand thou shalt have wherewith to magnify thine office, and to expound all scriptures, and continue in laying on of the hands and\nconfirming\nthe churches.\n10\nAnd thy brother Oliver shall continue in bearing my name before the\nworld\n, and also to the church. And he shall not suppose that he can say enough in my cause; and lo, I am with him to the end.\n11\nIn me he shall have glory, and not of himself, whether in weakness or in strength, whether in\nbonds\nor free;\n12\nAnd at all times, and in all places, he shall open his mouth and\ndeclare\nmy gospel as with the voice of a\ntrump\n, both day and night. And I will give unto him strength such as is not known among men.\n13\nRequire not\nmiracles\n, except I shall\ncommand\nyou, except\ncasting\nout\ndevils\n,\nhealing\nthe sick, and against\npoisonous\nserpents, and against deadly poisons;\n14\nAnd these things ye shall not do, except it be required of you by them who\ndesire\nit, that the scriptures might be\nfulfilled\n; for ye shall do according to that which is written.\n15\nAnd in whatsoever place ye shall\nenter\n, and they receive you not in my name, ye shall leave a cursing instead of a blessing, by casting off the\ndust\nof your feet against them as a testimony, and cleansing your feet by the wayside.\n16\nAnd it shall come to pass that whosoever shall lay their hands upon you by violence, ye shall\ncommand to be smitten in my name; and, behold, I will\nsmite\nthem according to your words, in mine own due time.\n17\nAnd whosoever shall go to law with thee shall be cursed by the law.\n18\nAnd thou shalt take no\npurse\nnor scrip, neither staves, neither two coats, for the church shall give unto thee in the very hour what thou needest for food and for raiment, and for shoes and for money, and for scrip.\n19\nFor thou art called to\nprune\nmy vineyard with a mighty pruning, yea, even for the last time; yea, and also all those whom thou hast\nordained\n, and they shall do even according to this pattern. Amen.",
  "depth": 2
}