{
  "url": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/45?lang=eng&id=p71#p71",
  "title": "Doctrine and Covenants 45",
  "description": "Revelation given through Joseph Smith the Prophet to the Church, at Kirtland, Ohio, March 7, 1831. Prefacing the record of this revelation, Joseph Smith’s history states that “at this age of the Church … many false reports … and foolish stories, were published … and circulated, … to prevent people from investigating the work, or embracing the faith. … But to the joy of the Saints, … I received the following.”",
  "timestamp": "2026-01-13T15:48:08.925624",
  "content": "1\nHearken, O ye people of my\nchurch\n, to whom the\nkingdom\nhas been given; hearken ye and give ear to him who laid the foundation of the earth, who\nmade\nthe heavens and all the\nhosts\nthereof, and by whom all things were made which\nlive\n, and move, and have a being.\n2\nAnd again I say, hearken unto my voice, lest\ndeath\nshall overtake you; in an\nhour\nwhen ye think not the summer shall be past, and the\nharvest\nended, and your souls not saved.\n3\nListen to him who is the\nadvocate\nwith the Father, who is pleading your cause before him—\n4\nSaying: Father, behold the\nsufferings\nand\ndeath\nof him who did no\nsin\n, in whom thou wast well pleased; behold the blood of thy Son which was shed, the blood of him whom thou gavest that thyself might be\nglorified\n;\n5\nWherefore, Father, spare these my\nbrethren\nthat\nbelieve\non my name, that they may come unto me and have\neverlasting life\n.\n6\nHearken, O ye people of my church, and ye elders listen together, and hear my voice while it is called\ntoday\n, and harden not your hearts;\n7\nFor verily I say unto you that I am\nAlpha and Omega\n, the beginning and the end, the light and the life of the world—a\nlight\nthat shineth in darkness and the darkness comprehendeth it not.\n8\nI came unto mine own, and mine own\nreceived me not\n; but unto as many as received me gave I\npower\nto do many\nmiracles\n, and to become the\nsons\nof God; and even unto them that\nbelieved\non my name gave I power to obtain eternal\nlife\n.\n9\nAnd even so I have sent mine\neverlasting\ncovenant\ninto the world, to be a\nlight\nto the world, and to be a\nstandard\nfor my people, and for the\nGentiles\nto seek to it, and to be a\nmessenger\nbefore my face to prepare the way before me.\n10\nWherefore, come ye unto it, and with him that cometh I will\nreason\nas with men in days of old, and I will show unto you my strong reasoning.\n11\nWherefore, hearken ye together and let me show unto you even my\nwisdom\n—the wisdom of him whom ye say is the God of\nEnoch\n, and his brethren,\n12\nWho were\nseparated\nfrom the earth, and were received unto myself—a\ncity\nreserved until a\nday\nof righteousness shall come—a day which was sought for by all holy men, and they found it not because of wickedness and abominations;\n13\nAnd confessed they were\nstrangers\nand pilgrims on the earth;\n14\nBut obtained a\npromise\nthat they should find it and see it in their flesh.\n15\nWherefore, hearken and I will reason with you, and I will\nspeak\nunto you and prophesy, as unto men in days of old.\n16\nAnd I will show it plainly as I showed it unto my\ndisciples\nas I stood before them in the flesh, and spake unto them, saying: As ye have\nasked of me concerning the\nsigns\nof my coming, in the day when I shall come in my\nglory\nin the clouds of heaven, to fulfil the promises that I have made unto your fathers,\n17\nFor as ye have looked upon the long\nabsence\nof your\nspirits\nfrom your bodies to be a bondage, I will show unto you how the day of redemption shall come, and also the\nrestoration\nof the\nscattered\nIsrael.\n18\nAnd now ye\nbehold\nthis temple which is in Jerusalem, which ye call the house of God, and your enemies say that this house shall never fall.\n19\nBut, verily I say unto you, that\ndesolation\nshall come upon this generation as a thief in the night, and this people shall be destroyed and\nscattered\namong all nations.\n20\nAnd this\ntemple\nwhich ye now see shall be thrown down that there shall not be left one stone upon another.\n21\nAnd it shall come to pass, that this\ngeneration\nof Jews shall not pass away until every desolation which I have told you concerning them shall come\nto pass\n.\n22\nYe say that ye know that the\nend\nof the world cometh; ye say also that ye know that the heavens and the earth shall pass away;\n23\nAnd in this ye say truly, for so it is; but these things which I have told you shall not\npass away\nuntil all shall be fulfilled.\n24\nAnd this I have told you concerning Jerusalem; and when that day shall come, shall a remnant be\nscattered\namong all\nnations\n;\n25\nBut they shall be\ngathered\nagain; but they shall remain until the times of the\nGentiles\nbe fulfilled.\n26\nAnd in\nthat day\nshall be heard of\nwars\nand rumors of wars, and the whole earth shall be in commotion, and men’s hearts shall\nfail\nthem, and they shall say that Christ\ndelayeth\nhis coming until the end of the earth.\n27\nAnd the\nlove\nof men shall wax cold, and\niniquity\nshall abound.\n28\nAnd when the times of the\nGentiles\nis come in, a\nlight\nshall break forth among them that sit in darkness, and it shall be the fulness of my\ngospel\n;\n29\nBut they\nreceive\nit not; for they perceive not the light, and they turn their\nhearts\nfrom me because of the\nprecepts\nof men.\n30\nAnd in that generation shall the\ntimes\nof the Gentiles be fulfilled.\n31\nAnd there shall be men standing in that\ngeneration\n, that shall not pass until they shall see an overflowing\nscourge\n; for a desolating\nsickness\nshall cover the land.\n32\nBut my disciples shall\nstand\nin\nholy places, and shall not be moved; but among the wicked, men shall lift up their voices and\ncurse\nGod and die.\n33\nAnd there shall be\nearthquakes\nalso in divers places, and many desolations; yet men will harden their hearts against me, and they will take up the\nsword\n, one against another, and they will kill one another.\n34\nAnd now, when I the Lord had spoken these words unto my disciples, they were troubled.\n35\nAnd I said unto them: Be not\ntroubled\n, for, when all these things shall come to pass, ye may know that the promises which have been made unto you shall be fulfilled.\n36\nAnd when the\nlight\nshall begin to break forth, it shall be with them like unto a parable which I will show you—\n37\nYe look and behold the\nfig trees\n, and ye see them with your eyes, and ye say when they begin to shoot forth, and their leaves are yet tender, that summer is now nigh at hand;\n38\nEven so it shall be in that day when they shall see all these things, then shall they know that the hour is nigh.\n39\nAnd it shall come to pass that he that\nfeareth\nme shall be\nlooking\nforth for the great\nday\nof the Lord to\ncome\n, even for the\nsigns\nof the coming of the\nSon of Man\n.\n40\nAnd they shall see signs and\nwonders\n, for they shall be shown forth in the heavens above, and in the earth beneath.\n41\nAnd they shall behold blood, and\nfire\n, and vapors of\nsmoke\n.\n42\nAnd before the day of the Lord shall come, the\nsun\nshall be darkened, and the moon be turned into blood, and the stars fall from heaven.\n43\nAnd the\nremnant\nshall be gathered unto this place;\n44\nAnd then they shall look for me, and, behold, I will come; and they shall see me in the\nclouds\nof heaven, clothed with power and great\nglory\n; with all the holy angels; and he that\nwatches\nnot for me shall be cut off.\n45\nBut before the arm of the Lord shall fall, an angel shall sound his\ntrump\n, and the\nsaints\nthat have slept shall\ncome\nforth to meet me in the\ncloud\n.\n46\nWherefore, if ye have slept in\npeace\nblessed are you; for as you now behold me and know that I am, even so shall ye\ncome\nunto me and your souls shall\nlive\n, and your redemption shall be perfected; and the saints shall come forth from the\nfour\nquarters of the earth.\n47\nThen shall the\narm\nof the Lord fall upon the nations.\n48\nAnd then shall the Lord set his foot upon this\nmount\n, and it shall cleave in twain, and the earth shall\ntremble\n, and reel to and fro, and the\nheavens\nalso\nshall shake\n.\n49\nAnd the Lord shall utter his voice, and all the ends of the earth shall hear it; and the nations of the earth shall\nmourn\n, and they that have\nlaughed\nshall see their\nfolly\n.\n50\nAnd calamity shall cover the\nmocker\n, and the scorner shall be consumed; and they that have watched for iniquity shall be hewn down and\ncast\ninto the\nfire\n.\n51\nAnd then shall the\nJews\nlook\nupon me and say: What are these\nwounds\nin thine hands and in thy feet?\n52\nThen shall they know that I am the Lord; for I will say unto them: These wounds are the wounds with which I was\nwounded\nin the house of my friends. I am he who was lifted up. I am Jesus that was\ncrucified\n. I am the\nSon of God\n.\n53\nAnd then shall they\nweep\nbecause of their iniquities; then shall they\nlament\nbecause they\npersecuted\ntheir\nking\n.\n54\nAnd then shall the\nheathen\nnations be\nredeemed\n, and they that\nknew no\nlaw\nshall have part in the\nfirst\nresurrection\n; and it shall be\ntolerable\nfor them.\n55\nAnd\nSatan\nshall be\nbound\n, that he shall have no place in the hearts of the children of men.\n56\nAnd at that day, when I shall come in my\nglory\n, shall the parable be fulfilled which I spake concerning the ten\nvirgins\n.\n57\nFor they that are wise and have received the\ntruth\n, and have taken the Holy Spirit for their\nguide\n, and have not been deceived—verily I say unto you, they shall not be hewn down and cast into the\nfire\n, but shall abide the day.\n58\nAnd the\nearth\nshall be given unto them for an\ninheritance\n; and they shall\nmultiply\nand wax strong, and their\nchildren\nshall\ngrow up\nwithout\nsin\nunto\nsalvation\n.\n59\nFor the Lord shall be in their\nmidst\n, and his\nglory\nshall be upon them, and he will be their\nking\nand their\nlawgiver\n.\n60\nAnd now, behold, I say unto you, it shall not be given unto you to know any further concerning this\nchapter, until the\nNew Testament\nbe translated, and in it all these things shall be made known;\n61\nWherefore I give unto you that ye may now translate it, that ye may be prepared for the things to come.\n62\nFor verily I say unto you, that great things await you;\n63\nYe hear of\nwars\nin foreign lands; but, behold, I say unto you, they are nigh, even at your\ndoors\n, and not many years hence ye shall hear of wars in your own lands.\n64\nWherefore I, the Lord, have said, gather ye out from the\neastern\nlands, assemble ye yourselves together ye elders of my church; go ye forth into the western countries, call upon the inhabitants to repent, and inasmuch as they do repent, build up churches unto me.\n65\nAnd with one heart and with one mind, gather up your riches that ye may\npurchase\nan inheritance which shall hereafter be appointed unto you.\n66\nAnd it shall be called the\nNew Jerusalem\n, a\nland\nof\npeace\n, a city of\nrefuge\n, a place of\nsafety\nfor the saints of the Most High God;\n67\nAnd the\nglory\nof the Lord shall be there, and the\nterror\nof the Lord also shall be there, insomuch that the wicked will not come unto it, and it shall be called Zion.\n68\nAnd it shall come to pass among the wicked, that every man that will not take his sword against his\nneighbor\nmust needs flee unto\nZion\nfor safety.\n69\nAnd there shall be\ngathered\nunto it out of every\nnation\nunder heaven; and it shall be the only people that shall not be at\nwar\none with another.\n70\nAnd it shall be said among the wicked: Let us not go up to battle against Zion, for the inhabitants of Zion are\nterrible\n; wherefore we cannot stand.\n71\nAnd it shall come to pass that the righteous shall be gathered out from among all nations, and shall come to Zion, singing with\nsongs\nof everlasting\njoy\n.\n72\nAnd now I say unto you, keep these things from going abroad unto the world until it is expedient in me, that ye may accomplish this work in the eyes of the people, and in the eyes of your enemies, that they may not know your works until ye have accomplished the thing which I have commanded you;\n73\nThat when they shall know it, that they may consider these things.\n74\nFor when the Lord shall appear he shall be\nterrible\nunto them, that fear may seize upon them, and they shall stand afar off and tremble.\n75\nAnd all nations shall be afraid because of the terror of the Lord, and the power of his might. Even so. Amen.",
  "depth": 2
}