{
  "url": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/25?lang=eng&id=p12#p12",
  "title": "Doctrine and Covenants 25",
  "description": "Revelation given through Joseph Smith the Prophet, at Harmony, Pennsylvania, July 1830 (see the heading to section 24). This revelation manifests the will of the Lord to Emma Smith, the Prophet’s wife.",
  "timestamp": "2026-01-10T13:25:05.390652",
  "content": "1\nHearken unto the voice of the Lord your God, while I speak unto you, Emma Smith, my daughter; for verily I say unto you, all those who\nreceive\nmy gospel are sons and daughters in my\nkingdom\n.\n2\nA revelation I give unto you concerning my will; and if thou art faithful and\nwalk\nin the paths of\nvirtue\nbefore me, I will preserve thy life, and thou shalt receive an\ninheritance\nin Zion.\n3\nBehold, thy\nsins\nare forgiven thee, and thou art an\nelect\nlady\n, whom I have\ncalled\n.\n4\nMurmur\nnot because of the\nthings\nwhich thou hast not seen, for they are\nwithheld\nfrom thee and from the world, which is wisdom in me in a time to come.\n5\nAnd the office of thy calling shall be for a\ncomfort\nunto my servant, Joseph Smith, Jun., thy\nhusband\n, in his\nafflictions\n, with consoling words, in the spirit of\nmeekness\n.\n6\nAnd thou shalt go with him at the time of his going, and be unto him for a scribe, while there is no one to be a scribe for him, that I may send my servant, Oliver Cowdery, whithersoever I will.\n7\nAnd thou shalt be\nordained\nunder his hand to expound scriptures, and to exhort the church,\naccording as it shall be given thee by my\nSpirit\n.\n8\nFor he shall lay his\nhands\nupon thee, and thou shalt receive the Holy Ghost, and thy time shall be given to writing, and to learning much.\n9\nAnd thou needest not fear, for thy\nhusband\nshall support thee in the church; for unto them is his\ncalling\n, that all things might be\nrevealed\nunto them, whatsoever I will, according to their faith.\n10\nAnd verily I say unto thee that thou shalt lay aside the\nthings\nof this\nworld\n, and\nseek\nfor the things of a\nbetter\n.\n11\nAnd it shall be given thee, also, to make a selection of\nsacred\nhymns\n, as it shall be given thee, which is pleasing unto me, to be had in my church.\n12\nFor my soul\ndelighteth\nin the\nsong\nof the\nheart\n; yea, the\nsong\nof the righteous is a prayer unto me, and it shall be answered with a blessing upon their heads.\n13\nWherefore,\nlift up\nthy heart and\nrejoice\n, and cleave unto the covenants which thou hast made.\n14\nContinue in the spirit of meekness, and beware of\npride\n. Let thy soul delight in thy\nhusband\n, and the\nglory\nwhich shall come upon him.\n15\nKeep my commandments continually, and a\ncrown\nof\nrighteousness\nthou shalt receive. And except thou do this, where I am you\ncannot\ncome.\n16\nAnd verily, verily, I say unto you, that this is my\nvoice\nunto all. Amen.",
  "depth": 2
}