{
  "url": "https://www.churchofjesuschrist.org/study/scriptures/bofm/moro/6?lang=eng&id=9#note4c",
  "title": "Moroni 6",
  "description": "Repentant persons are baptized and fellowshipped—Church members who repent are forgiven—Meetings are conducted by the power of the Holy Ghost. About A.D. 401–21.",
  "timestamp": "2026-01-10T13:26:16.143129",
  "content": "1\nAnd now I speak concerning baptism. Behold, elders, priests, and teachers were baptized; and they were not baptized save they brought forth\nfruit\nmeet that they were\nworthy\nof it.\n2\nNeither did they receive any unto baptism save they came forth with a\nbroken\nheart\nand a contrite spirit, and witnessed unto the church that they truly repented of all their sins.\n3\nAnd none were received unto baptism save they\ntook upon\nthem the name of Christ, having a determination to serve him to the end.\n4\nAnd after they had been received unto baptism, and were wrought upon and\ncleansed\nby the power of the Holy Ghost, they were numbered among the people of the\nchurch\nof Christ; and their\nnames\nwere taken, that they might be remembered and nourished by the good word of God, to keep them in the right way, to keep them continually\nwatchful\nunto prayer,\nrelying\nalone upon the merits of Christ, who was the author and the finisher of their faith.\n5\nAnd the\nchurch\ndid meet together\noft\n, to\nfast\nand to pray, and to speak one with another concerning the welfare of their souls.\n6\nAnd they did\nmeet\ntogether oft to partake of bread and wine, in\nremembrance\nof the Lord Jesus.\n7\nAnd they were strict to observe that there should be\nno iniquity\namong them; and whoso was found to commit iniquity, and\nthree\nwitnesses of the church did condemn them before the\nelders\n, and if they repented not, and\nconfessed\nnot, their names were\nblotted out\n, and they were not\nnumbered\namong the people of Christ.\n8\nBut\nas\noft as they repented and sought forgiveness, with real\nintent\n, they were\nforgiven\n.\n9\nAnd their meetings were\nconducted\nby the church after the manner of the workings of the Spirit, and by the\npower\nof the Holy Ghost; for as the power of the Holy Ghost led them whether to preach, or to exhort, or to pray, or to supplicate, or to sing, even so it was done.",
  "depth": 2
}