{
  "url": "https://www.churchofjesuschrist.org/study/manual/instructions-for-singing-time-2021/singing?lang=eng",
  "title": "Instructions for Singing Time",
  "description": "Instructions for Singing Time",
  "timestamp": "2026-01-10T11:43:55.949478",
  "content": "“Instructions for Singing Time and the Children’s Sacrament Meeting Presentation,”\nCome, Follow Me—For Primary: Doctrine and Covenants 2021\n(2020)\n“Instructions for Singing Time,”\nCome, Follow Me—For Primary: 2021\nDear Primary Presidencies and Music Leaders,\nPrimary songs are a powerful tool to help children learn about Heavenly Father’s plan of happiness and the foundational truths of the gospel of Jesus Christ. As children sing about gospel principles, the Holy Ghost will testify of their truthfulness. The words and music will stay in the children’s minds and hearts throughout their lives.\nSeek the help of the Spirit as you prepare to teach the gospel through music. Share your testimony of the truths you sing about. Help the children see how the music relates to what they are learning and experiencing at home and in Primary classes. The children and their families will be blessed by your devoted efforts.\nWe love you and extend our gratitude for the dedicated service you are giving to fortify and protect our precious children.\nThe Primary General Presidency\n5 minutes (Primary presidency): Opening prayer, scripture or article of faith, and one talk\n20 minutes (music leader): Singing time\nThe purpose of singing time is to help children deepen their faith in Heavenly Father and Jesus Christ through music. The Primary presidency and music leader select songs for each month with this purpose in mind. The songs should reinforce principles the children are learning about the gospel of Jesus Christ in their classes and at home. A list of songs that reinforce these principles is included in this guide. These songs are also suggested in the outlines in\nCome, Follow Me—For Primary.\nAs you teach songs to the children, invite them to share what they have already learned about the stories and doctrinal principles the songs teach. You may want to review the\nCome, Follow Me—For Primary\noutlines that the children are studying in their classes. This will help you become aware of the stories and principles they are learning so you can consider how to support their learning with music.\nDuring singing time, you can also review songs the children have previously learned and songs they enjoy singing. As you review, invite the children to share their thoughts and feelings about the truths found in the songs.\nThe\nChildren’s Songbook\nis the basic resource for music in Primary. Hymns from the hymnbook and songs from Church magazines are also appropriate. Occasionally children may sing patriotic or holiday songs that are suitable for Sunday and for the children’s ages. The use of any other music in Primary must be approved by the bishopric (see\nHandbook 2: Administering the Church,\n11.2.4\n).\nEach week, Primary includes:\nSinging time:\n25 minutes\nTransition:\n5 minutes\nClasses:\n20 minutes\nLeaders of larger Primaries may divide children into two groups and have one group in Primary classes while the other group is in singing time. Then the two groups would switch places. In such cases, Primary leaders may need to adjust the times shown above to suit their circumstances.\n“\nJoseph Smith’s First Prayer\n,”\nHymns,\nno. 26\n“\nSearch, Ponder, and Pray\n,”\nChildren’s Songbook,\n109\n“\nFamily History—I Am Doing It\n,”\nChildren’s Songbook,\n94\n“\nI Want to Be a Missionary Now\n,”\nChildren’s Songbook,\n168\n“\nThe Priesthood Is Restored\n,”\nChildren’s Songbook,\n89\n“\nI Stand All Amazed\n,”\nHymns,\nno. 193\n“\nThe Church of Jesus Christ\n,”\nChildren’s Songbook,\n77\n“\nWhen I Am Baptized\n,”\nChildren’s Songbook,\n103\n“\nWhen He Comes Again\n,”\nChildren’s Songbook,\n82–83\n“\nJesus Has Risen\n,”\nChildren’s Songbook,\n70\n“\nI Want to Be a Missionary Now\n,”\nChildren’s Songbook,\n168\n“\nJesus Said Love Everyone\n,”\nChildren’s Songbook,\n61\n“\nWhen He Comes Again\n,”\nChildren’s Songbook,\n82–83\n“\nHave I Done Any Good?\n”\nHymns,\nno. 223\n“\nChoose the Right\n,”\nHymns,\nno. 239\n“\nI’m Trying to Be like Jesus\n,”\nChildren’s Songbook,\n78–79\n“\nReverence Is Love\n,”\nChildren’s Songbook,\n31\n“\nHelp Me, Dear Father\n,”\nChildren’s Songbook,\n99\n“\nI Know That My Redeemer Lives\n,”\nHymns,\nno. 136\n“\nHave I Done Any Good?\n”\nHymns,\nno. 223\n“\nI Feel My Savior’s Love\n,”\nChildren’s Songbook,\n74–75\n“\nThe Priesthood Is Restored\n,”\nChildren’s Songbook,\n89\n“\nThe Holy Ghost\n,”\nChildren’s Songbook,\n105\n“\nI Am a Child of God\n,”\nChildren’s Songbook,\n2–3\n“\nReverently, Quietly\n,”\nChildren’s Songbook,\n26\n“\nI Am like a Star\n,”\nChildren’s Songbook,\n163\n“\nI Will Be Valiant\n,”\nChildren’s Songbook,\n162\n“\nThe Spirit of God\n,”\nHymns,\nno. 2\n“\nI Love to See the Temple\n,”\nChildren’s Songbook,\n95\n“\nThe Church of Jesus Christ\n,”\nChildren’s Songbook,\n77\n“\nFamily History—I Am Doing It\n,”\nChildren’s Songbook,\n94\n“\nFamilies Can Be Together Forever\n,”\nChildren’s Songbook,\n188\n“\nPraise to the Man\n,”\nHymns,\nno. 27\n“\nI Will Follow God’s Plan\n,”\nChildren’s Songbook,\n164–65\n“\nHe Sent His Son\n,”\nChildren’s Songbook,\n34–35\n“\nHark! The Herald Angels Sing\n,”\nHymns,\nno. 209\nRemember that the purpose of singing time isn’t just to teach the children how to sing, but to use music to help deepen their faith in Heavenly Father and Jesus Christ. The following ideas can inspire you as you plan ways to do this.\nLearn of Heavenly Father and Jesus Christ.\nInvite the children to share what they learn about Heavenly Father and Jesus Christ from the songs you sing. Invite them to share their favorite words from the song that describe God and the Savior.\nRead related scriptures.\nFor many of the songs in the\nChildren’s Songbook\nand the hymnbook, references to related scriptures are listed. Help the children read a scripture passage, and talk about how it relates to the song you’re singing. You could also list a few scripture references on the board and invite the children to match each reference to a song or a verse from a song.\nFill in the blank.\nWrite a verse of the song on the board with several key words missing. Then ask the children to sing the song, listening for the words that fill in the blanks. As they fill in each blank, discuss what gospel principles you learn from the missing words.\nQuotations from Church leaders.\nInvite the children to listen to a quotation from a Church leader that teaches the same gospel principle as the Primary song. Ask them to raise their hand when they hear something that helps them understand the truth they are singing about. Ask them to share what they heard.\nTestify.\nBear brief testimony to the children of gospel truths found in the Primary song. Help the children understand that singing is one way they can bear testimony and feel the Spirit.\nStand as a witness.\nInvite children to take turns standing and sharing what they learn from the song they are singing or how they feel about the truths taught in the song. Ask them how they feel as they sing the song, and help them identify the influence of the Holy Ghost.\nUse pictures.\nAsk the children to help you find or create pictures that go with important words or phrases in the song. Invite them to share how the pictures relate to the song and what the song teaches. For example, if you are teaching the song “\nWhen He Comes Again\n” (\nChildren’s Songbook,\n82–83), you could place pictures throughout the room that depict important words from the song (such as\nangels,\nsnow,\nand\nstar\n). Ask the children to gather the pictures and hold them up in the correct order as you sing the song together.\nShare an object lesson.\nYou could use an object to inspire discussion about a song. For example, the song “\nWhen I Am Baptized\n” (\nChildren’s Songbook,\n103) mentions rain. You could show the children a picture of rain or a glass of water and talk about how baptism and the Holy Ghost cleanse our spirits like rainwater cleanses the earth; this could lead to a discussion about the blessings of being baptized and receiving the gift of the Holy Ghost.\nInvite sharing of personal experiences.\nHelp the children connect the principles taught in the song with experiences they have had with those principles. For example, before singing “\nI Love to See the Temple\n” (\nChildren’s Songbook,\n95), you could ask the children to raise their hands if they have seen a temple. Invite them to think as they sing about how they feel when they see a temple.\nAsk questions.\nThere are many questions you can ask as you sing songs. For example, you can ask the children what they learn from each verse in the song. You can also ask them to think of questions that the song answers. This can lead to a discussion about the truths taught in the song.\nListen for answers.\nAsk the children to listen for answers to questions. For example, the song “\nHe Sent His Son\n” (\nChildren’s Songbook,\n34–35) contains several questions and answers. You could ask the children the questions and then have them listen for answers as they sing.\nChildren learn a song by hearing and singing it over and over again. Always sing the words of a new song to the children—don’t just read or recite them. This helps the children connect the melody to the words. After a song is taught, review it in a variety of fun ways throughout the year. Below are some ideas to help children learn and review songs.\nDemonstrate the pitch.\nTo help children learn the melody of a song, hold your hand in a horizontal position, and as you sing the words, move your hand up to indicate higher pitches and down to indicate lower pitches.\nEcho.\nInvite the children to be your echo by repeating what you sing. Sing to the children a short phrase or a line, and then have them sing it back to you.\nUse variation.\nSing songs in a variety of ways, such as whispering, humming, clapping the beat, varying the tempo, or singing while sitting or standing. You could also make a cube out of paper and, on each side of the cube, write a different way to sing. Invite a child to roll the cube to decide how the children will sing the song.\nSing in groups.\nGive each class or individual one phrase to sing while standing, and then have them exchange phrases until each class or individual has had a turn singing each phrase.\nUse actions.\nInvite the children to think of simple actions to help them remember the words and messages of a song. For example, when you sing “\nReverently, Quietly\n” (\nChildren’s Songbook,\n26), you could invite the children to fold their arms, bow their heads, and touch their hearts when they sing the relevant lines in the song.\nGirls sing, boys sing.\nDraw a picture of a boy and a picture of a girl. While reviewing a song, hold up one of the pictures to indicate who should sing that part of the song.\nBasket toss.\nPlace numbered baskets or other containers at the front of the room—as many containers as there are verses of a particular song. Invite one of the children to toss a beanbag or crumpled piece of paper into or near a numbered container. Have the children sing the verse with the same number as the container.\nMatch a picture to a phrase.\nWrite each line of a song on a different piece of paper, and find a picture that represents each line. Place the pictures on one side of the room and the papers on the other side. Sing the song, and ask the children to match the pictures to the words.\nCreate posters.\nDisplay posters with the words from each verse or pictures that represent the words. As the children sing, cover up some of the words or pictures until they can sing the entire verse without the poster. You can also invite the children to help you create the posters.\nUnder the direction of the bishop, the children’s sacrament meeting presentation is normally held during the fourth quarter of the year. As the Primary presidency and music leader, arrange to meet early in the year with the counselor in the bishopric who oversees Primary to begin discussing plans for the presentation. When you have completed the plans, obtain his approval for them.\nThe presentation should allow the children to present what they and their families have learned about the gospel of Jesus Christ from the Doctrine and Covenants at home and in Primary, including the Primary songs they have sung during the year. Prayerfully consider which gospel principles and songs support what they have learned. Throughout the year, keep notes of children’s talks and personal experiences for possible use in the presentation. Invite children to share scriptures, stories, and their testimonies of the Savior and His gospel in the presentation. As you plan the presentation, think of ways it can help the congregation focus on the Savior and the truths He restored in the latter days.\nUnits with small numbers of children may consider ways in which family members can participate with their children. A member of the bishopric may conclude the meeting with brief remarks.\nAs you prepare the presentation, remember the following guidelines:\nPractices should not take unnecessary time away from Primary classes or families.\nVisuals, costumes, and media presentations are not appropriate for sacrament meeting.\nSee\nHandbook 2: Administering the Church,\n11.5.3\n,\nChurchofJesusChrist.org\n.",
  "depth": 1
}