{
  "url": "https://www.churchofjesuschrist.org/initiative/new-hymns?lang=eng",
  "title": "New Hymnbook – Church of Jesus Christ of Latter-day Saints",
  "description": "The Church is making a major revision of the hymnbook and the Children's Songbook. Explore the latest announcements and other information related to this historic project from The Church of Jesus Christ of Latter-day Saints.",
  "timestamp": "2026-01-10T11:42:20.109637",
  "content": "New Music Now Available\nSmall batches of new music from\nHymns—For Home and Church\nwill now be released every few months in nine languages. Gradual releases for several other languages will begin when translations are ready.\nView New Music Collection\nView the new collection in other languages:\nDeutsch\nEnglish\nEspañol\nFrançais\nPortuguês\nTagalog\n한국어\n日本語\nThe new music collection is also available in the updated Sacred Music app (\niOS\n,\nAndroid\n) and in the\nGospel Library\n.\nHow to Start Using the New Music\nYou are encouraged to use this new music in your personal worship and study now. Unit leaders and those with music callings are also encouraged to incorporate new music into worship services.\nMessage from Elder Renlund on the New Hymns\nMenu\nMessage from Elder Renlund on the New Hymns\nElder Dale G. Renlund describes the process of selecting hymns for the new collection. He encourages members and leaders to use the new hymns to increase faith and worship and to unify their families and congregations.\nNew Hymns at Home\nMenu\nNew Hymns at Home\nSacred music can enhance your gospel study and worship at home, both individually and with your family. Learn how you can incorporate sacred music into your life and receive the blessings that come with it.\nNew Hymns at Church\nMenu\nNew Hymns at Church\nSacred music is a foundational part of our worship at church. Learn some ideas for incorporating new music into experiences at church.\nBackground and Status\nIn June 2018, the Church announced a revision of the hymnbook and\nChildren’s Songbook\nto meet the needs of a global church. This announcement began a multiyear project to gather and review the current music collection, new member-submitted compositions for the hymnbook, and songs from other Christian faith traditions.\nChurch digital music channels, including the online Church Music Library and the Sacred Music app, received major updates to prepare for the digital delivery of the new hymnbook. An audio version of the hymnbook and other music training resources are being developed.\nWhat to Expect\nDigital advance releases have begun in English, Spanish, Portuguese, French, German, Korean, Japanese, and Tagalog. Batches of music in additional languages will follow the same early-release model as they become ready.\nThe full print and digital release of\nHymns—For Home and Church\nis currently anticipated in English, Spanish, Portuguese, French, and American Sign Language in mid-2027. It will be released in many additional languages in the coming years.\nAn abbreviated hymns collection called\nSelected Hymns\nis being developed for emerging languages of the Church. Time lines and further details will be announced as they become clear.\nQuestions about the New Hymnbook\nWhat will be different about the new hymnbook?\nHymns—For Home and Church\nwill be a collection of about 375 hymns and children’s songs combined into a single resource. The main collection will include the same song list and numbering across all languages in print and digital channels.\nWill my national anthem be in the hymnbook?\nBecause the new core collection will be the same in every language, national anthems will not be included in the printed hymnbooks. However, sacred music of local interest may be made available to members by language through digital channels as they meet the goals of sacred music within a given country.\nWhen will the hymns be available in my language?\nMusic translation, printing, and distribution for the worldwide Church is a major undertaking. Therefore, the leaders of the Church have decided to release\nHymns—For Home and Church\nin language phases, starting in 2027. It will be completed in many other languages in the next several years. Each language will receive several small batches of new music spaced out over approximately two and a half years before the release of the full hymnbook.\nWhat resources are available to learn the new hymns?\nAudio recordings are released for every title, including piano and guitar accompaniment and vocal recordings. Members can familiarize themselves with the new music by creating playlists within the Sacred Music app.\nThe interactive sheet music on the updated online Music Library provides tools to hear each voice part of a hymn and transpose music into new keys.\nWard music coordinators can use the “Sacrament Meeting Hymns” tool in the Gospel Library app to program music for sacrament meeting. The tool has been updated to allow selections from the new advance release of\nHymns—for Home and Church\n, the current hymnbook, and the current\nChildren’s Songbook\n. By using this feature, members of the congregation will have quick access on Sundays from their Home screen to music that is not available in the pews. For more details about this tool, see this training video: “\nSacrament Meeting Hymns\n.”\nWhy are the books being revised?\nThe Church has released an updated hymnbook and other music collections every few decades, and the senior Church leaders have determined that the timing is right for an update to the 1985 hymnbook and 1989\nChildren’s Songbook\n.\nIssues that are being resolved with the new collection include:\nInconsistency in music offerings across languages spoken by members of the Church.\nDoctrinal inaccuracies, culturally insensitive language, and limited cultural representation of the global Church.\nLicensing limitations for music publishing, particularly impacting digital use.\nHymns that have fallen into disuse and can be retired to make way for other music that will be more valued.\nUnaddressed gospel principles in our current collections.\nHymns that many members find are too difficult to sing or play.\nWho oversees the revisions?\nUnder the direction of the First Presidency and Quorum of the Twelve Apostles, General Authorities and General Officers were assigned to oversee the hymnbook and\nChildren’s Songbook\nrevision. Those assignments have rotated many times since 2018, providing input from those with a diversity of experiences and perspectives from around the globe.\nHymnbook and\nChildren’s Songbook\ncommittees work under the direction of the assigned General Authorities and General Officers. The committees are composed of Church employees and called members with expertise in a variety of areas, including music, education, literature, world cultures, and Church doctrine.\nWhat has been the process for approving songs?\nThe main task of the hymnbook and\nChildren’s Songbook\ncommittees is to recommend music to the senior leaders of the Church. Recommendations have come from the Church’s current global library, hymns originating from other Christian faiths, and the 17,000 original pieces submitted for this new hymnbook. In some cases, the committees also recommend text and music revisions to align each piece with the criteria for this collection. The senior leaders of the Church, including the Quorum of the Twelve Apostles and First Presidency, counsel together about the committee recommendations to approve music for the collection.\nWhat are the criteria for songs in this new collection?\nAll decisions about the new collection are based on five guiding principles that were informed and approved by the First Presidency. These criteria guide the review, editing, and leader approval process for every piece of music all the way up to the Quorum of the Twelve Apostles and First Presidency. Music included in the new\nHymns—For Home and Church\ncollection should:\n1. Increase faith in and worship of Heavenly Father and His Son, Jesus Christ.\n2. Teach the core doctrine of the gospel with power and clarity.\n3. Invite joyful singing at home and at church.\n4. Comfort the weary and inspire members to endure in faith.\n5. Unify members throughout the Church.\nI submitted a song. When will I know if it has been accepted?\nThe review and selection of music is expected to be completed early in 2025. At that point, all submitters will be notified at the same time of the status of their pieces. The Church leaders and committees involved in the project are grateful for all those who have made contributions to the hymnbook project in any way.\nWhat will happen to the current hymnbook and\nChildren’s Songbook\n?\nThe current books will continue to be used until the full new collection is released in print and digital channels. These current collections will be available as legacy items through digital channels once the new books are distributed.\nMusic-Related Resources\nEleven New Hymns Now Available in Hymns—For Home and Church\nCelebrating One Year of Hymns—For Home and Church\nFifteen New Hymns Available to Use in Church and at Home\nNine New Hymns Released for New Global Hymnbook\nRelease of New Hymnbook Begins with First Wave of 13 Songs\nA Glimpse into World Report April 2024: A Portion of the New Hymnbook Is Coming in May\nSacred Hymnbook to Help Unite, Uplift Latter-day Saints of All Ages Worldwide\nCommittees Thank Members for “Overwhelming” Response to Hymnbook Revision Efforts\nChurch Announces Plans for New Hymnbook and\nChildren’s Songbook",
  "depth": 0
}