{
  "url": "https://www.churchofjesuschrist.org/study/manual/general-handbook/1-work-of-salvation-and-exaltation?lang=eng&id=title_number7-p28#title_number7",
  "title": "1. God’s Plan and Your Role in His Work of Salvation and Exaltation",
  "description": "This chapter will help you gain a vision of God’s plan of happiness, His work of salvation and exaltation, and the purpose of The Church of Jesus Christ of Latter-day Saints.",
  "timestamp": "2026-01-13T15:49:04.430332",
  "content": "“1. God’s Plan and Your Role in His Work of Salvation and Exaltation,”\nGeneral Handbook: Serving in The Church of Jesus Christ of Latter-day Saints\n(2025).\n“1. God’s Work of Salvation and Exaltation,”\nGeneral Handbook\n.\nYou have been called to serve in The Church of Jesus Christ of Latter-day Saints. Thank you for your service. You will bless lives and experience joy as you serve faithfully.\nThis handbook will help you learn principles of Christlike service and understand your responsibilities. You will be most effective when you align your service in the Church with the work of God the Father and His Son, Jesus Christ. This chapter will help you gain a vision of:\nGod’s plan of happiness.\nGod’s work of salvation and exaltation.\nThe purpose of The Church of Jesus Christ of Latter-day Saints.\nHeavenly Father provided the plan of happiness to enable us to enjoy all His blessings. His work and glory is to “bring to pass the immortality and eternal life of man” (\nMoses 1:39\n). Immortality is to live forever with a resurrected physical body. Eternal life, or exaltation, is to become like God and live in His presence eternally as families.\nJesus Christ is central to God’s plan. Because of Heavenly Father’s infinite love for us, He sent His Son to redeem us from sin and death through His atoning sacrifice (see\nJohn 3:16\n). Through His Atonement, Jesus Christ ensures that each of us born on earth will be resurrected and gain immortality.\nTo receive eternal life, we must “come unto Christ” (\nMoroni 10:32\n). The Savior’s Atonement makes it possible for us to be cleansed from sin and have our hearts changed so we can receive eternal life and a fulness of joy. Heavenly Father wants all of His children to choose to return to Him.\nAs we come unto Christ and help others do the same, we participate in God’s work of salvation and exaltation. This work is guided by the two great commandments to love God and to love our neighbors (see\nMatthew 22:37–39\n).\nGod’s work of salvation and exaltation focuses on four divinely appointed responsibilities. These are outlined below.\nThis handbook will help you understand these four aspects of God’s work.\nLiving the gospel of Jesus Christ includes:\nExercising faith in Christ, repenting daily, making covenants with God as we receive the ordinances of salvation and exaltation, and enduring to the end by keeping those covenants (see\n3.5.1\n).\nLearning and teaching the gospel of Jesus Christ at home and at church.\nBecoming self-reliant in providing for ourselves and our families, both spiritually and temporally.\nCaring for those in need includes:\nServing and ministering to individuals, families, and communities.\nSharing resources, including Church assistance, with those in need.\nHelping others become self-reliant.\nInviting all to receive the gospel includes:\nParticipating in missionary work and serving as missionaries.\nHelping new and returning Church members progress along the covenant path.\nUniting families for eternity includes:\nMaking covenants as we receive our own temple ordinances.\nDiscovering our deceased ancestors and performing ordinances for them in the temple so they can make covenants with God.\nGoing to the temple regularly, where possible, to worship God and perform ordinances for His children.\nJesus Christ established His Church to enable individuals and families to assist God in fulfilling His work of salvation and exaltation (see\nEphesians 4:11–13\n; see also\n2.2\nin this handbook). To help accomplish this divine purpose, the Church and its leaders provide:\nPriesthood authority and keys.\nCovenants and ordinances.\nProphetic direction.\nScriptures.\nGospel learning and teaching support.\nService and leadership opportunities.\nA community of Saints.\nThrough the priesthood, God accomplishes His work of salvation and exaltation. The priesthood authority and keys needed to direct God’s work on earth were restored to the Prophet Joseph Smith (see\nDoctrine and Covenants 110:11–16\n;\n112:30\n; see also\n3.1\nin this handbook). These keys are held by Church leaders today. These leaders call and authorize others to assist in God’s work (see\nDoctrine and Covenants 107:8, 65–67\n).\nIn Heavenly Father’s plan, we make covenants as we receive the ordinances of salvation and exaltation, such as baptism (see\nJohn 3:5\n; see also\nchapter 18\nin this handbook). These covenants and ordinances are essential for us to become more like God and return to dwell in His presence (see\nDoctrine and Covenants 84:19–22\n).\nThrough His chosen prophets, God reveals truth and provides inspired guidance and warnings (see\nAmos 3:7\n;\nDoctrine and Covenants 1:4\n). This guidance helps us enter and remain on the path leading to eternal life.\nUnder the direction of the Lord’s prophets and apostles, the Church provides and preserves the word of God as found in the holy scriptures. The scriptures testify of Christ, teach His gospel, and help us exercise faith in Him (see\nJacob 7:10–11\n;\nHelaman 15:7\n).\nThe Church supports individuals and families in their responsibility to learn the truths of the gospel and teach these truths to family members and others (see\nDoctrine and Covenants 88:77–78, 118\n; see also\n2.2.3\nin this handbook).\nThrough callings and assignments in the Church, God gives members opportunities to serve and lead. The Church provides structure to help care for members in need and to give humanitarian relief to others (see\nMosiah 18:27–29\n).\nAs a community of Saints, Church members gather regularly to worship God and to remember the Savior by partaking of the sacrament (see\nMoroni 6:4–6\n;\nDoctrine and Covenants 20:77\n). Members also care for and minister to one another (see\nEphesians 2:19\n).\nAs a leader in the Church, you are called to teach and support those you serve as they assist God in His work of salvation and exaltation (see\n1.2\n). Having a clear understanding of God’s work, of what He invites you to do, and of the purpose of His Church will help you focus your efforts in bringing souls to Christ.\nPrayerfully seek to know how you can help bring about God’s purposes in the lives of those you serve. God will direct you through the promptings of the Holy Ghost (see\n2 Nephi 32:5\n). Laboring with the Lord in His vineyard will bring you great joy (see\nJacob 5:70–72\n).",
  "depth": 2
}