{
  "url": "https://www.churchofjesuschrist.org/callings/church-safety-and-health/protecting-children-and-youth",
  "title": "Protecting Children and Youth",
  "description": "All leaders and teachers of children or youth are to complete this training within one month of being called.",
  "timestamp": "2026-01-13T15:49:26.467271",
  "content": "Protecting Children and Youth\nAll leaders and teachers of children or youth are to complete this training within one month of being called.\nClick here for training\nChurch activities and classes are opportunities for children and youth to feel the love of the Savior and the influence of the Holy Ghost. While participating, children and youth need to feel safe and protected. Leaders and teachers should follow the Savior’s example of love and concern for children.\nThis training covers how to recognize and prevent physical, sexual, verbal, and other types of abuse. The resources below can also help you recognize and prevent abuse. The training provides scenarios to help you better understand and apply key principles and policies.\nKey Principles and Policies Covered in the Training\nThe Lord expects us to do all we can to prevent abuse and to protect and help those who have been victims of abuse.\nThe Church does not tolerate abuse in any form. Abuse violates the laws of God and may also be a violation of the laws of society.\nWhen adults are teaching children or youth in Church settings, “at least two responsible adults should be present” (\nGeneral Handbook: Serving in The Church of Jesus Christ of Latter-day Saints,\nClasses for Youth—\n13.4.1\nand Safeguarding Children,\n12.5.1\n).\n“At least two adults must be present at all Church activities attended by children and youth” (\nGeneral Handbook,\nAdult Supervision\n20.7.1\n).\nAvoid extended one-on-one communication with children or youth, and regularly communicate with parents or guardians about activities or concerns.\nWhen Inappropriate Behavior or Abuse Happens, You Should Act Promptly to Protect the Child or Youth.\nUS and Canada\nIf you learn of abuse, you should immediately contact legal authorities. You should also counsel with your bishop or stake president, who will call the abuse help line for guidance in helping victims and meeting reporting requirements.\nCountries outside of the US and Canada\nLearn how and when you should report abuse. In most countries, you will immediately need to contact legal authorities. Counsel with your bishop or stake president for direction. If the abuse help line is not available in your country, the bishop will counsel with the stake president and area office to learn the proper process for reporting abuse and protecting the person that was abused.\nChildren and youth who have been abused need kind, caring attention from inspired Church leaders, family members, and others, including trained professionals, who can help them overcome the destructive effects of abuse. The healing power of the Savior Jesus Christ will ease burdens and provide strength to overcome adversity.\nPlease view the Frequently Asked Questions below for more information about this online training module and about how to prevent and respond to abuse in your calling.\nCommon Questions\nWho needs to take the training?\nThis training is for anyone called to work with children or youth. This includes\nStake and district presidencies, bishoprics, and branch presidencies.\nHigh councilors.\nStake, district, ward, and branch Primary, Young Men, Young Women, Sunday School, elders quorum, and Relief Society presidencies.\nSecretaries, teachers, advisers, camp leaders, activity day leaders, music leaders, pianists, and others serving in positions in the Primary, Young Women, and Young Men organizations.\nTeachers in youth Sunday School and seminary classes.\nHow long will the training take?\nThis training should take about 30 minutes to complete.\nHow often will I need to take the training?\nIf you have a calling working with children or youth, you need this training every three years. You will receive an email reminder before the expiration date of your training.\nDoes this training apply to ministering?\n“The guideline that two responsible adults be present with youth does not apply to the assignment of ministering companions. However, under the direction of their bishop, leaders should use wisdom and seek inspiration when assigning youth as companions to adults. They also seek guidance from the bishop When a youth is assigned to a companion who is not his or her parent, leaders confirm the the parents do not object to the assignment.\n“Adult companions should avoid situations that might be misunderstood. They should use care regarding isolated one-on-one situations. They help youth have a safe and rewarding experience with ministering” (\nGeneral Handbook: Serving in The Church of Jesus Christ of Latter-day Saints,\nOrganizing Ministering to Meet Local Needs\n21.3\n, ChurchofJesusChrist.org).\nDoes this change the policy for interviews with youth?\n“When they meet with youth, leaders follow the principles in 31.1. Many of these principles are especially important when meeting with youth ” (\nGeneral Handbook: Protecting against Misunderstandings\n, 31.3.1, ChurchofJesusChrist.org).\nWill I need to take this again if I move to another ward or branch?\nNo. This training is valid for three years.\nDo I need to sign in to access this training?\nYes, you will need to sign in with your Church Account. If your Church Account is not linked with your Membership Record Number (MRN), you will need to update that information before completing the training or your completion will not be recorded.\nTo link your MRN to your Church Account, first find your MRN on your temple recommend or by asking your ward clerk or another Church leader to look it up on ChurchofJesusChrist.org or through the Member Tools app. Once you have your MRN, go to the\nmembership section of your Church Account\n. For more information, visit\nChurch Account help\n.\nHow will leaders know who needs to take the training?\nBishops and ward clerks can view a list of members who need to complete the training in the Leader and Clerk Resources section of ChurchofJesusChrist.org. This list will be updated regularly.\nAs a priesthood leader, what do I need to know before extending a call?\nLeaders and teachers of children and youth are asked to complete the training, if possible, within one month of being sustained.\nCan anyone take this training?\nYes. In addition to those working with children and youth, parents and others are also welcome to complete the training.\nNeed help?\nIf you need help setting up an account to access Church resources, see your ward or stake clerk. You can also talk to your leaders if you need access to a computer to complete the training.\nIf you experience issues with the training, click\nFeedback\nhere or at the bottom of the page.\nWhat if my question is not answered here?\nPlease send your question by clicking\nFeedback\nhere or at the bottom of the page.\nChurch Resources\nabuse.ChurchofJesusChrist.org\nCounseling Resources: Abuse (Help for the Victim) for Ward and Stake Leaders\nGospel Topics: Abuse\nsafety.ChurchofJesusChrist.org\nReporting Resources\n“\nIn Crisis? Talk Now.\n” (abuse.ChurchofJesusChrist.org)\nState laws on reporting abuse\nAdditional Resources and Information\nChild Welfare Information Gateway\nChildren’s Bureau\nNational Child Traumatic Stress Network\nstopbullying.gov\nLast Updated On 7 Oct 2025",
  "depth": 2
}